# BRepBuilderEdgeGeometry Properties

---
The BRepBuilderEdgeGeometry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
BRepBuilderEdgeGeometry Class
Autodesk.Revit.DB Namespace